var locale = {};

locale.ua = {
    dnd_0: "Перетягніть файл ключа сюди",
    dnd_1: "Теперь перетягніть файл сертифікату",
    intro_1: ("Щоб накласти на документ електронний підпис, перетягніть на сторінку файл ключа, який вам видали у Центрі Сертифікації. Зазвичай, чей файл має ім\`я \"key_6.dat\", та є прихованим на флешці. Після цього, ви можете запам`ятати ключ у локальному сховищі браузера."),

    add_sign: "Накласти підпис на документ",
    to_store: "Зберегти у свовище",
};

locale.ru = {
    dnd_0: "Перетащите файл ключа",
    dnd_1: "Теперь перетащите файл сертификата",
    intro_1: ("Чтобы наложить электронную подпись на документ, перетащите на страницу файл секретного ключа, который вам выдали в Центре Сертификации. Обычно этот файл называется \"key_6.dat\" и находится на флешке в скрытом виде"),

    add_sign: "Наложить подпись на документ",
    to_store: "Сохранить в хранилище",
};

module.exports = locale;
